package cn.sda.pinyin;
public class CharsLibrary_1 {
	private CharsLibrary_1(){
	}
	public static final char[] A = {
		'啊','阿','呵','吖','嗄','腌','锕'}; 
	public static final char[] AI = {
		'爱','矮','挨','哎','碍','癌','艾','唉','哀','蔼','隘','埃','皑','呆','嗌','嫒','瑷','暧','捱','砹','嗳','锿','霭','乃','剀','呃','噫','奇','阂'};
	public static final char[] AN = {
		'按','安','暗','岸','俺','案','鞍','氨','胺','厂','广','庵','揞','犴','铵','桉','谙','鹌','埯','黯','干','盒','钳','顸'};
	public static final char[] ANG = {
		'昂','肮','盎','仰'};
	public static final char[] AO = {
		'袄','凹','傲','奥','熬','懊','敖','翱','澳','嚣','拗','媪','廒','骜','嗷','坳','遨','聱','螯','獒','鏊','鳌','鏖','岙','噢','棍','浇'};
	public static final char[] BA = {
		'把','八','吧','爸','拔','罢','跋','巴','芭','扒','坝','霸','叭','靶','笆','疤','耙','捌','粑','茇','岜','鲅','钯','魃','菝','灞','伯','捭','杷','湃','萆'};
	public static final char[] BAI = {
		'百','白','摆','败','柏','拜','佰','伯','稗','捭','呗','掰','扒','排','派','薜','鞴'};
	public static final char[] BAN = {
		'半','办','班','般','拌','搬','版','斑','板','伴','扳','扮','瓣','颁','绊','癍','坂','钣','舨','阪','瘢','分','彬','豳','辨','辩'};
	public static final char[] BANG = {
		'帮','棒','绑','磅','镑','邦','榜','蚌','傍','梆','膀','谤','浜','蒡','彭','旁','纺','螃'};
	public static final char[] BAO = {
		'包','抱','报','饱','保','暴','薄','宝','爆','剥','豹','刨','雹','褒','堡','苞','胞','鲍','炮','瀑','龅','孢','煲','褓','鸨','趵','葆','勹','呆','簿','袍','裒'};
	public static final char[] BEI = {
		'被','北','倍','杯','背','悲','备','碑','卑','贝','辈','钡','焙','狈','惫','臂','褙','悖','蓓','鹎','鐾','呗','邶','鞴','孛','陂','碚','俾','埤','怫','波','菩','萆','葡','蜚','跋'};
	public static final char[] BEN = {
		'本','奔','苯','笨','夯','锛','贲','畚','坌','体'};
	public static final char[] BENG = {
		'蹦','绷','甭','崩','迸','蚌','泵','甏','嘣','俸','傍','唪','堋','平','抨','旁','榜'};
	public static final char[] BI = {
		'比','笔','闭','鼻','碧','必','避','逼','毕','臂','彼','鄙','壁','蓖','币','弊','辟','蔽','毙','庇','敝','陛','毖','痹','秘','泌','秕','薜','荸','芘','萆','匕','裨','畀','俾','嬖','狴','筚','箅','篦','舭','荜','襞','庳','铋','跸','吡','愎','贲','滗','濞','璧','哔','髀','弼','妣','婢','仳','佛','卑','埤','复','媲','幅','庀','拂','捭','服','枇','檗','殍','波','瞥','纰','脾','虑','被','费','跛','鐾','陂','陴','馥'};
	public static final char[] BIAN = {
		'边','变','便','遍','编','辩','扁','贬','鞭','卞','辨','辫','忭','砭','匾','汴','碥','蝙','褊','鳊','笾','苄','窆','弁','髟','缏','煸','封','拚','稹'};
	public static final char[] BIAO = {
		'表','标','彪','膘','杓','婊','飑','飙','鳔','瘭','飚','镳','裱','骠','镖','剽','嫖','漂','灬','苞','鏖','髟'};
	public static final char[] BIE = {
		'别','憋','鳖','瘪','蹩','扒','拔','捌','撇','秘','蔽'};
	public static final char[] BIN = {
		'宾','濒','摈','彬','斌','滨','豳','膑','殡','缤','髌','傧','槟','鬓','镔','玢','份','浜','频'};
	public static final char[] BING= {
		'并','病','兵','冰','丙','饼','屏','秉','柄','炳','摒','槟','禀','邴','冫','平','拼','枋','燹','绠'};
	public static final char[] BO= {
		'拨','波','播','泊','博','伯','驳','玻','剥','薄','勃','菠','钵','搏','脖','帛','般','柏','舶','渤','铂','箔','膊','魄','卜','礴','跛','檗','亳','鹁','踣','啵','蕃','簸','钹','饽','擘','佛','募','孛','怕','拍','拔','擗','暴','服','泼','潘','瀑','爆','番','白','百','簿','艴','菩','蒲','薜','蘖','趵','跑','鲅'};
	public static final char[] BU = {
		'不','步','补','布','部','捕','卜','簿','哺','堡','埠','怖','埔','瓿','逋','晡','钸','钚','醭','卟','拊','溥','薄','附','鞴'};
	public static final char[] CA = {
		'擦','拆','礤','嚓','蔡'};
	public static final char[] CAI = {
		'才','菜','采','材','财','裁','猜','踩','睬','蔡','彩'};
	public static final char[] CAN = {
		'蚕','残','掺','参','惨','惭','餐','灿','骖','璨','孱','黪','粲'};
	public static final char[] CANG = {
		'藏','仓','沧','舱','苍','伧','臧'};
	public static final char[] CAO = {
		'草','操','曹','槽','糙','嘈','艚','螬','漕','屮','澡','艹','造'};
	public static final char[] CE = {
		'册','侧','策','测','厕','恻','帻','栅','赦'};
	public static final char[] CEN = {
		'参','岑','涔'};
	public static final char[] CENG = {
		'曾','层','蹭','噌','僧','增','缯'};
	public static final char[] CHA = {
		'查','插','叉','茶','差','岔','搽','察','茬','碴','刹','诧','楂','槎','镲','衩','汊','馇','檫','姹','杈','锸','嚓','土','捷','接','斜','猹','苴','荼','钗'};
	public static final char[] CHAI = {
		'柴','拆','差','豺','钗','瘥','虿','侪','叉','搓','查','茈','龇'};
	public static final char[] CHAN = {
		'产','缠','掺','搀','阐','颤','铲','谗','蝉','单','馋','觇','婵','蒇','谄','冁','廛','孱','蟾','羼','镡','忏','潺','禅','骣','躔','澶','兔','厘','嬗','崭','掸','沾','渐','胀','苫','裣','谶'};
	public static final char[] CHANG = {
		'长','唱','常','场','厂','尝','肠','畅','昌','敞','倡','偿','猖','裳','鲳','氅','菖','惝','嫦','徜','鬯','阊','怅','伥','昶','苌','娼','倘','尚','淌'};
	public static final char[] CHAO = {
		'朝','抄','超','吵','潮','巢','炒','嘲','剿','绰','钞','怊','焯','耖','晁','唠','涛','绉','绍','诌'};
	public static final char[] CHE = {
		'车','撤','扯','掣','彻','尺','澈','坼','砗','多','宅','屮','斥','池'};
	public static final char[] CHEN = {
		'趁','称','辰','臣','尘','晨','沉','陈','衬','橙','忱','郴','榇','抻','谌','碜','谶','宸','龀','嗔','伧','琛','堪','填','帘','枕','沈','湛','疹','眈','缜','肜','胂','闯'};
	public static final char[] CHENG = {
		'成','乘','盛','撑','称','城','程','呈','诚','秤','惩','逞','骋','澄','橙','承','塍','柽','埕','铖','噌','铛','酲','晟','裎','枨','蛏','丞','瞠','伥','净','呛','嵊','徵','抢','敞','樘','浈','盯','趟','蹦','郢','醒'};
	public static final char[] CHI = {
		'吃','尺','迟','池','翅','痴','赤','齿','耻','持','斥','侈','弛','驰','炽','匙','踟','坻','茌','墀','饬','媸','豉','褫','敕','哧','瘛','蚩','啻','鸱','眵','螭','篪','魑','叱','彳','笞','嗤','傺','哆','啸','喜','她','抬','拆','拖','提','搋','柢','沱','治','滞','眙','离','移','胝','芪','茬','莉','蛇','踅','饰','骊'};
	public static final char[] CHONG = {
		'冲','重','虫','充','宠','崇','涌','种','艟','忡','舂','铳','憧','茺','僮','潼','烛','盅','茧','酮'};
	public static final char[] CHOU = {
		'抽','愁','臭','仇','丑','稠','绸','酬','筹','踌','畴','瞅','惆','俦','帱','瘳','雠','圳','妯','扭','揄','溴','诌','钮','鲋'};
	public static final char[] CHU = {
		'出','处','初','锄','除','触','橱','楚','础','储','畜','滁','矗','搐','躇','厨','雏','楮','杵','刍','怵','绌','亍','憷','蹰','黜','蜍','樗','助','柠','涂','淑','硫','祝','絮','著','褚','诎','诸'};
	public static final char[] CHUA = {
	'撮'};
	public static final char[] CHUAI = {
		'揣','膪','啜','嘬','搋','踹'};
	public static final char[] CHUAN = {
		'穿','船','传','串','川','喘','椽','氚','遄','钏','舡','舛','巛','惴','掾','踹','镩'};
	public static final char[] CHUANG = {
		'窗','床','闯','创','疮','幢','怆','仓','囱','舂','葱'};
	public static final char[] CHUI = {
		'吹','垂','炊','锤','捶','椎','槌','棰','陲'};
	public static final char[] CHUN = {
		'春','唇','纯','蠢','醇','淳','椿','蝽','莼','鹑','朐','沌','肫','辁'};
	public static final char[] CHUO = {
		'戳','绰','踔','啜','龊','辍','促','斫','淖','焯','簇','缀','荃','蔟','趵','踱','躇','辶','醛','镞'};
	public static final char[] CI = {
		'次','此','词','瓷','慈','雌','磁','辞','刺','茨','伺','疵','赐','差','兹','呲','鹚','祠','糍','厕','司','嵯','措','柴','滋','粢','茈','荠','蚝','螅','趑'};
	public static final char[] CONG = {
		'从','丛','葱','匆','聪','囱','琮','枞','淙','璁','骢','苁','偬','窗','纵'};
	public static final char[] COU = {
		'凑','楱','辏','腠','奏','揍','族','簇','蔟','薮','趋','趣'};
	public static final char[] CU = {
		'粗','醋','簇','促','卒','徂','猝','蔟','蹙','酢','殂','蹴','且','戚','绉','趋','趣','错'};
	public static final char[] CUAN = {
		'窜','蹿','篡','攒','汆','爨','镩','撺','昕'};
	public static final char[] CUI = {
		'催','脆','摧','翠','崔','淬','衰','瘁','粹','璀','啐','悴','萃','毳','榱','体','察','隹'};
	public static final char[] CUN = {
		'村','寸','存','蹲','忖','皴','浚'};
	public static final char[] CUO = {
		'错','撮','搓','挫','措','磋','嵯','厝','鹾','脞','痤','蹉','瘥','锉','矬','摧','昔','最','躜'};
	public static final char[] DA = {
		'大','答','达','打','搭','瘩','塔','笪','耷','哒','褡','疸','怛','靼','妲','沓','嗒','鞑','塌','胆','迭'};
	public static final char[] DAI = {
		'带','代','呆','戴','待','袋','逮','歹','贷','怠','傣','大','殆','呔','玳','迨','岱','甙','黛','骀','绐','埭','棣','毒','诒','逯','隶','驮'};
	public static final char[] DAN = {
		'但','单','蛋','担','弹','掸','胆','淡','丹','耽','旦','氮','诞','郸','惮','石','疸','澹','瘅','萏','殚','眈','聃','箪','赕','儋','啖','冉','坛','忱','怛','憾','檐','湛','潭','澶','膻','蜒','觇','詹','赡'};
	public static final char[] DANG = {
		'当','党','挡','档','荡','谠','铛','宕','菪','凼','裆','砀','场','烫'};
	public static final char[] DAO = {
		'到','道','倒','刀','岛','盗','稻','捣','悼','导','蹈','祷','帱','纛','忉','焘','氘','叨','俦','刂','受','啁','忑','惆','洮','涛','陶','鸟'};
	public static final char[] DE = {
		'的','地','得','德','底','锝','登','陟'};
	public static final char[] DEI = {
	'得'};
	public static final char[] DENG = {
		'等','灯','邓','登','澄','瞪','凳','蹬','磴','镫','噔','嶝','戥','簦','橙'};
	public static final char[] DI = {
		'地','第','底','低','敌','抵','滴','帝','递','嫡','弟','缔','堤','的','涤','提','笛','迪','狄','翟','蒂','觌','邸','谛','诋','嘀','柢','骶','羝','氐','棣','睇','娣','荻','碲','镝','坻','籴','砥','勺','啻','杓','约','胝','芍','莜','蹄','逐','逮','隶','题'};
	public static final char[] DIA = {
	'嗲'};
	public static final char[] DIAN = {
		'点','电','店','殿','淀','掂','颠','垫','碘','惦','奠','典','佃','靛','滇','甸','踮','钿','坫','阽','癫','簟','玷','巅','癜','埝','拈','沾','涎','蜓'};
	public static final char[] DIAO = {
		'掉','钓','叼','吊','雕','调','刁','碉','凋','鸟','铞','铫','鲷','貂','佻','倜','刀','挑','稠','粜','绸','莜','蜩','赵','跳','踔','轺','骠'};
	public static final char[] DIE = {
		'爹','跌','叠','碟','蝶','迭','谍','牒','堞','瓞','揲','蹀','耋','鲽','垤','喋','佚','涉','渫','窒','至','褶','踢','轶','鳎'};
	public static final char[] DING = {
		'顶','定','盯','订','叮','丁','钉','鼎','锭','町','玎','铤','腚','碇','疔','仃','耵','酊','啶','奠','汀','灯','葶'};
	public static final char[] DIU = {
		'丢','铥'};
	public static final char[] DONG = {
		'动','东','懂','洞','冻','冬','董','栋','侗','恫','峒','鸫','垌','胨','胴','硐','氡','岽','咚','桐','甬','筒','酮'};
	public static final char[] DOU = {
		'都','斗','豆','逗','陡','抖','痘','兜','读','蚪','窦','篼','蔸','投','渎','窬','逾','酡','钭'};
	public static final char[] DU = {
		'读','度','毒','渡','堵','独','肚','镀','赌','睹','杜','督','都','犊','妒','顿','蠹','笃','嘟','渎','椟','牍','黩','髑','芏','土','宅','橐','竺','纛','诧','锗'};
	public static final char[] DUAN = {
		'段','短','断','端','锻','缎','椴','煅','簖','彖','踹'};
	public static final char[] DUI = {
		'对','队','堆','兑','敦','镦','碓','怼','憝','夺','追','锐'};
	public static final char[] DUN = {
		'吨','顿','蹲','墩','敦','钝','盾','囤','遁','不','趸','沌','盹','镦','礅','炖','砘','俊','豚'};
	public static final char[] DUO = {
		'多','朵','夺','舵','剁','垛','跺','惰','堕','掇','哆','驮','度','躲','踱','沲','咄','铎','裰','哚','缍','兑','捶','揣','杂','柁','棰','沱','郸','锗','陀','隋'};
	public static final char[] E = {
		'饿','哦','额','鹅','蛾','扼','俄','讹','阿','遏','峨','娥','恶','厄','鄂','锇','谔','垩','锷','阏','萼','苊','轭','婀','莪','鳄','颚','腭','愕','呃','噩','鹗','屙','亚','伪','侉','哑','啊','啐','垭','庵','曷','歹','硪','胺','邑','隘','鬲'};
	public static final char[] EI = {
	'诶'};
	public static final char[] EN = {
		'恩','摁','蒽','嗯'};
	public static final char[] ER = {
		'而','二','耳','儿','饵','尔','贰','洱','珥','鲕','鸸','佴','迩','铒','濡'};
	public static final char[] FA = {
		'发','法','罚','伐','乏','筏','阀','珐','垡','砝','拔','拨','泛','贬'};
	public static final char[] FAN = {
		'反','饭','翻','番','犯','凡','帆','返','泛','繁','烦','贩','范','樊','藩','矾','钒','燔','蘩','畈','蕃','蹯','梵','幡','拚','蟠','袢'};
	public static final char[] FANG = {
		'放','房','防','纺','芳','方','访','仿','坊','妨','肪','钫','彷','邡','枋','舫','鲂','匚'};
	public static final char[] FEI = {
		'非','飞','肥','费','肺','废','匪','吠','沸','菲','诽','啡','篚','蜚','腓','扉','妃','斐','狒','芾','悱','镄','霏','翡','榧','淝','鲱','绯','痱','怫','拂','砩','祓','绋','茇','裴'};
	public static final char[] FEN = {
		'分','份','芬','粉','坟','奋','愤','纷','忿','粪','酚','焚','吩','氛','汾','棼','瀵','鲼','玢','偾','鼢','匪','喷','奔','愍','扮','拚','燔','盼','贲','颁'};
	public static final char[] FENG = {
		'风','封','逢','缝','蜂','丰','枫','疯','冯','奉','讽','凤','峰','锋','烽','砜','俸','酆','葑','沣','唪','捧','泛','蚌','逄','鹏'};
	public static final char[] FO = {
	'佛'};
	public static final char[] FOU = {
		'否','缶','不'};
	public static final char[] FU = {
		'副','幅','扶','浮','富','福','负','伏','付','复','服','附','俯','斧','赴','缚','拂','夫','父','符','孵','敷','赋','辅','府','腐','腹','妇','抚','覆','辐','肤','氟','佛','俘','傅','讣','弗','涪','袱','市','甫','釜','脯','腑','阜','咐','黼','砩','苻','趺','跗','蚨','芾','鲋','幞','茯','滏','蜉','拊','菔','蝠','鳆','蝮','绂','绋','赙','罘','稃','匐','麸','凫','桴','莩','孚','馥','驸','怫','祓','呋','郛','芙','艴','黻','不','仅','包','呒','哺','宓','彳','怀','掊','沸','溥','莆','费','还','锫','阝','鞴'};
	public static final char[] GA = {
		'噶','胳','夹','嘎','咖','轧','钆','伽','旮','尬','尕','尜','呷'};
	public static final char[] GAI = {
		'该','改','盖','概','钙','芥','溉','戤','垓','丐','陔','赅','咳','核','汽','胲','阂','骸'};
	public static final char[] GAN = {
		'赶','干','感','敢','竿','甘','肝','柑','杆','赣','秆','旰','酐','矸','疳','泔','苷','擀','绀','橄','澉','淦','尴','坩','个','乾','奸','捍','汗'};
	public static final char[] GANG = {
		'刚','钢','纲','港','缸','岗','杠','冈','肛','扛','筻','罡','戆','亢','伉','抗','肮','颃'};
	public static final char[] GAO = {
		'高','搞','告','稿','膏','篙','羔','糕','镐','皋','郜','诰','杲','缟','睾','槔','锆','槁','藁','咎','浩','蒿'};
	public static final char[] GE = {
		'个','各','歌','割','哥','搁','格','阁','隔','革','咯','胳','葛','蛤','戈','鸽','疙','盖','屹','合','铬','硌','骼','颌','袼','塥','虼','圪','镉','仡','舸','鬲','嗝','膈','搿','纥','哿','介','可','噶','浩','砝','菏','钾','铪','闸','髂'};
	public static final char[] GEI = {
	'给'};
	public static final char[] GEN = {
		'跟','根','哏','茛','亘','艮','痕'};
	public static final char[] GENG = {
		'更','耕','颈','梗','耿','庚','羹','埂','赓','鲠','哽','绠','亢','硬','邢'};
	public static final char[] GONG = {
		'工','公','功','共','弓','攻','宫','供','恭','拱','贡','躬','巩','汞','龚','红','肱','觥','珙','蚣','咣','廾','杠','虹','蛩','赣'};
	public static final char[] GOU = {
		'够','沟','狗','钩','勾','购','构','苟','垢','句','岣','彀','枸','鞲','觏','缑','笱','诟','遘','媾','篝','佝','区','拘','鸲'};
	public static final char[] GU = {
		'古','股','鼓','谷','故','孤','箍','姑','顾','固','雇','估','咕','骨','辜','沽','蛊','贾','菇','梏','鸪','汩','轱','崮','菰','鹄','鹘','钴','臌','酤','呱','鲴','诂','牯','瞽','毂','锢','牿','痼','觚','蛄','罟','嘏','告','哌','枯','滑','瓠','皋','胍','苦','角','骰'};
	public static final char[] GUA = {
		'挂','刮','瓜','寡','剐','褂','卦','呱','胍','鸹','栝','诖','惴','舌'};
	public static final char[] GUAI = {
		'怪','拐','乖','掴','哙'};
	public static final char[] GUAN = {
		'关','管','官','观','馆','惯','罐','灌','冠','贯','棺','纶','盥','矜','莞','掼','涫','鳏','鹳','倌','串','斡','果','桄','沦','菅'};
	public static final char[] GUANG = {
		'光','广','逛','桄','犷','咣','胱','恍','扩','横','潢'};
	public static final char[] GUI = {
		'归','贵','鬼','跪','轨','规','硅','桂','柜','龟','诡','闺','瑰','圭','刽','傀','癸','炔','庋','宄','桧','刿','鳜','鲑','皈','匦','妫','晷','簋','炅','伪','匮','哇','娃','桅','概','沩','洼','祈','绘','觖','蹶','隗'};
	public static final char[] GUN = {
		'滚','棍','辊','鲧','衮','磙','绲','丨','浑','混','锟','鳏'};
	public static final char[] GUO = {
		'过','国','果','裹','锅','郭','涡','埚','椁','聒','馘','猓','崞','掴','帼','呙','虢','蜾','蝈','划','唬','囗','搓','枸','活','蜮','蠃','锞'};
	public static final char[] HA = {
		'哈','蛤','虾','铪','吓','呵','獬'};
	public static final char[] HAI = {
		'还','海','害','咳','氦','孩','骇','骸','亥','嗨','醢','胲','咴','阂','颏'};
	public static final char[] HAN = {
		'喊','含','汗','寒','汉','旱','酣','韩','焊','涵','函','憨','翰','罕','撼','捍','憾','悍','邯','邗','菡','撖','瀚','阚','顸','蚶','焓','颔','晗','鼾','厂','嵌','感','旰','泔','淦','滩','澉','甘','矸','轩','钤'};
	public static final char[] HANG = {
		'行','巷','航','夯','杭','吭','颃','沆','绗','珩','桁','炕','狼','肮','酐'};
	public static final char[] HAO = {
		'好','号','浩','嚎','壕','郝','毫','豪','耗','貉','镐','昊','颢','灏','嚆','蚝','嗥','皓','蒿','濠','薅','唬','妞','皋','睾'};
	public static final char[] HE = {
		'和','喝','合','河','禾','核','何','呵','荷','贺','赫','褐','盒','鹤','菏','貉','阂','涸','吓','嗬','劾','盍','翮','阖','颌','壑','诃','纥','曷','呙','呼','哈','嗑','害','揭','格','洽','渴','硅','缴','苛','藿','蚵','蝎','辂','辖','阋','霍','鹄'};
	public static final char[] HEI = {
		'黑','嘿','嗨'};
	public static final char[] HEN = {
		'很','狠','恨','痕','哏','掀','艮'};
	public static final char[] HENG = {
		'横','恒','哼','衡','亨','行','桁','珩','蘅','訇'};
	public static final char[] HONG = {
		'红','轰','哄','虹','洪','宏','烘','鸿','弘','讧','訇','蕻','闳','薨','黉','荭','泓','汪','港'};
	public static final char[] HOU = {
		'后','厚','吼','喉','侯','候','猴','鲎','篌','堠','後','逅','糇','骺','瘊','诟'};
	public static final char[] HU = {
		'湖','户','呼','虎','壶','互','胡','护','糊','弧','忽','狐','蝴','葫','沪','乎','戏','核','和','瑚','唬','鹕','冱','怙','鹱','笏','戽','扈','鹘','浒','祜','醐','琥','囫','烀','轷','瓠','煳','斛','鹄','猢','惚','岵','滹','觳','唿','槲','汩','羽','胍','芦','芴','苦','虍','许','钴','雇'};
	public static final char[] HUA = {
		'话','花','化','画','华','划','滑','哗','猾','豁','铧','桦','骅','砉','侉','劐','哇','学','找','敌','浍','稞','鲑'};
	public static final char[] HUAI = {
		'坏','怀','淮','槐','徊','划','踝','喟','圳','坯'};
	public static final char[] HUAN = {
		'换','还','唤','环','患','缓','欢','幻','宦','涣','焕','豢','桓','痪','漶','獾','擐','逭','鲩','郇','鬟','寰','奂','锾','圜','洹','萑','缳','浣','垸','援','灌','瑗','皖','眩','脘','鹳'};
	public static final char[] HUANG = {
		'黄','慌','晃','荒','簧','凰','皇','谎','惶','蝗','磺','恍','煌','幌','隍','肓','潢','篁','徨','鳇','遑','癀','湟','蟥','璜','芒','茫'};
	public static final char[] HUI = {
		'回','会','灰','绘','挥','汇','辉','毁','悔','惠','晦','徽','恢','秽','慧','贿','蛔','讳','徊','卉','烩','诲','彗','浍','珲','蕙','喙','恚','哕','晖','隳','麾','诙','蟪','茴','洄','咴','虺','荟','缋','堕','桧','涣','皓','眭','睢','虫','违','韦'};
	public static final char[] HUN = {
		'混','昏','荤','浑','婚','魂','阍','珲','馄','溷','诨','挥','捆','昆','棍','绲','缗'};
	public static final char[] HUO = {
		'或','活','火','伙','货','和','获','祸','豁','霍','惑','嚯','镬','耠','劐','藿','攉','锪','蠖','钬','夥','化','扮','灬','瓠','越'};
	public static final char[] JI = {
		'几','及','急','既','即','机','鸡','积','记','级','极','计','挤','己','季','寄','纪','系','基','激','吉','脊','际','汲','肌','嫉','姬','绩','缉','饥','迹','棘','蓟','技','冀','辑','伎','祭','剂','悸','济','籍','寂','期','其','奇','忌','齐','妓','继','集','给','革','击','圾','箕','讥','畸','稽','疾','墼','洎','鲚','屐','齑','戟','鲫','嵇','矶','稷','戢','虮','诘','笈','暨','笄','剞','叽','蒺','跻','嵴','掎','跽','霁','唧','畿','荠','瘠','玑','羁','丌','偈','芨','佶','赍','楫','髻','咭','蕺','觊','麂','骥','殛','岌','亟','犄','乩','芰','哜','倚','卟','厝','居','彐','揖','棋','洁','猗','疵','瘵','睽','瞿','秸','粢','结','脔','萁','蕲','家','加','假','价','架','甲','佳','夹'};
	public static final char[] JIA = {
		'家','加','假','价','架','甲','佳','夹','嘉','驾','嫁','枷','荚','颊','钾','稼','茄','贾','铗','葭','迦','戛','浃','镓','痂','恝','岬','跏','嘏','伽','胛','笳','珈','瘕','郏','袈','蛱','呷','咖','夏','押','拮','挈','挟','揩','暇','袷','铪','颉','骆','骱'};
	public static final char[] JIAN = {
		'见','件','减','尖','间','键','贱','肩','兼','建','检','箭','煎','简','剪','歼','监','坚','奸','健','艰','荐','剑','渐','溅','涧','鉴','浅','践','捡','柬','笺','俭','碱','硷','拣','舰','槛','缄','茧','饯','翦','鞯','戋','谏','牮','枧','腱','趼','缣','搛','戬','毽','菅','鲣','笕','谫','楗','囝','蹇','裥','踺','睑','謇','鹣','蒹','僭','锏','湔','前','喊','堑','孱','柙','滥','犍','箴','纤','茛','谮','钱','险','骞'};
	public static final char[] JIANG = {
		'将','讲','江','奖','降','浆','僵','姜','酱','蒋','疆','匠','强','桨','虹','豇','礓','缰','犟','耩','绛','茳','糨','洚','红'};
	public static final char[] JIAO = {
		'叫','脚','交','角','教','较','缴','觉','焦','胶','娇','绞','校','搅','骄','狡','浇','矫','郊','嚼','蕉','轿','窖','椒','礁','饺','铰','酵','侥','剿','徼','艽','僬','蛟','敫','峤','跤','姣','皎','茭','鹪','噍','醮','佼','湫','鲛','挢','乔','侨','却','咬','妖','学','激','纠','菽'};
	public static final char[] JIE = {
		'接','节','街','借','皆','截','解','界','结','届','姐','揭','戒','介','阶','劫','芥','竭','洁','疥','藉','价','楷','秸','桔','杰','捷','诫','睫','家','偈','桀','喈','拮','骱','羯','蚧','嗟','颉','鲒','婕','碣','讦','孑','疖','诘','亥','假','卩','唧','圾','契','她','担','拾','暨','概','渴','獬','砝','祖','籍','纥','袷','锴','髫'};
	public static final char[] JIN = {
		'进','近','今','仅','紧','金','斤','尽','劲','禁','浸','锦','晋','筋','津','谨','巾','襟','烬','靳','廑','瑾','馑','槿','衿','堇','荩','矜','噤','缙','卺','妗','赆','觐','吟','肋','钅','锓'};
	public static final char[] JING = {
		'竟','静','井','惊','经','镜','京','净','敬','精','景','警','竞','境','径','荆','晶','鲸','粳','颈','兢','茎','睛','劲','痉','靖','肼','獍','阱','腈','弪','刭','憬','婧','胫','菁','儆','旌','迳','靓','泾','晟','檠','氏','烃','箐','蜻','醒','陉','青'};
	public static final char[] JIONG = {
		'窘','囧','炯','扃','迥','冂','垧','炅'};
	public static final char[] JIU = {
		'就','九','酒','旧','久','揪','救','纠','舅','究','韭','厩','臼','玖','灸','咎','疚','赳','鹫','蹴','僦','柩','桕','鬏','鸠','阄','啾','噍','愁','湫','缪','蝤'};
	public static final char[] JU = {
		'句','举','巨','局','具','距','锯','剧','居','聚','拘','菊','矩','沮','拒','惧','鞠','狙','驹','且','据','柜','桔','俱','车','咀','疽','踞','炬','倨','醵','裾','屦','犋','苴','窭','飓','锔','椐','苣','琚','掬','榘','龃','趄','莒','雎','遽','橘','踽','榉','鞫','钜','讵','枸','仇','佝','告','姐','娶','拱','渠','瞿','租','篓','菹','蒌','蘧','蛆','足','邹','鄹','锄','雏','骄','鬻'};
	public static final char[] JUAN = {
		'卷','圈','倦','鹃','捐','娟','眷','绢','鄄','锩','蠲','镌','狷','桊','涓','隽','擐','泫','甄','眩','睃','蕊','蜷','身'};
	public static final char[] JUE = {
		'决','绝','觉','角','爵','掘','诀','撅','倔','抉','攫','嚼','脚','桷','噱','橛','嗟','觖','劂','爝','矍','镢','獗','珏','崛','蕨','噘','谲','蹶','孓','厥','乙','屈','柽','狂','穴','蕞','蛙','蠼','较','阕','阙','鞒','鳜'};
	public static final char[] JUN = {
		'军','君','均','菌','俊','峻','龟','竣','骏','钧','浚','郡','筠','麇','皲','捃','匀','旬','狻','訇','隽'};
	public static final char[] KA = {
		'卡','喀','咯','咖','胩','咔','佧','珈'};
	public static final char[] KAI= {
		'开','揩','凯','慨','楷','垲','剀','锎','铠','锴','忾','恺','蒈','劾','喝','核','渴','溘','雉'};
	public static final char[] KAN = {
		'看','砍','堪','刊','嵌','坎','槛','勘','龛','戡','侃','瞰','莰','阚','凵','喊','莶','馅'};
	public static final char[] KANG = {
		'抗','炕','扛','糠','康','慷','亢','钪','闶','伉','坑','奋','杭','沆','荒'};
	public static final char[] KAO = {
		'靠','考','烤','拷','栲','犒','尻','铐','彀','挢','搞','槁'};
	public static final char[] KE = {
		'可','克','棵','科','颗','刻','课','客','壳','渴','苛','柯','磕','咳','坷','呵','恪','岢','蝌','缂','蚵','轲','窠','钶','氪','颏','瞌','锞','稞','珂','髁','疴','嗑','溘','骒','喀','盍','碣','铪','锕','龛'};
	public static final char[] KEI = {
	'刻'};
	public static final char[] KEN = {
		'肯','啃','恳','垦','裉','垠','狠','颀','龈'};
	public static final char[] KENG = {
		'坑','吭','铿','忐','硎','胫','铒'};
	public static final char[] KONG = {
		'空','孔','控','恐','倥','崆','箜','穹','腔'};
	public static final char[] KOU = {
		'口','扣','抠','寇','蔻','芤','眍','筘','叩','佝','妪','挎'};
	public static final char[] KU = {
		'哭','库','苦','枯','裤','窟','酷','刳','骷','喾','堀','绔','古','圣','挎','掘','跨'};
	public static final char[] KUA = {
		'跨','垮','挎','夸','胯','侉','锞','髁'};
	public static final char[] KUAI = {
		'快','块','筷','会','侩','哙','蒯','浍','郐','狯','脍','傀','蒉','魁'};
	public static final char[] KUAN = {
		'宽','款','髋','完','棵','颗'};
	public static final char[] KUANG = {
		'矿','筐','狂','框','况','旷','匡','眶','诳','邝','纩','夼','诓','圹','贶','哐','兄','枉','湟','磺','逛'};
	public static final char[] KUI = {
		'亏','愧','奎','窥','溃','葵','魁','馈','盔','傀','岿','匮','愦','揆','睽','跬','聩','篑','喹','逵','暌','蒉','悝','喟','馗','蝰','隗','夔','缺','臾','觖','踩','阕','顷'};
	public static final char[] KUN = {
		'捆','困','昆','坤','鲲','锟','髡','琨','醌','阃','悃','卵','混','顽','馄','鳏','龈'};
	public static final char[] KUO = {
		'阔','扩','括','廓','适','蛞','栝','会','刳','哙','邝'};
}
