package cn.sda.pinyin;
public class CharsLibrary_3 {
	private CharsLibrary_3(){
	}
	public static final char[] SHU = {
		'书','树','数','熟','输','梳','叔','属','束','术','述','蜀','黍','鼠','淑','赎','孰','蔬','疏','戍','竖','墅','庶','薯','漱','恕','枢','暑','殊','抒','曙','署','舒','姝','摅','秫','纾','沭','毹','腧','塾','菽','殳','澍','倏','俞','售','嗽','娶','揄','朱','杼','涑','疋','荼','薮','豫','透','野','镯','除','鹬'};
	public static final char[] SHUA = {
		'刷','耍','唰','唆','涮','选'};
	public static final char[] SHUAI = {
		'摔','甩','率','帅','衰','蟀','绥'};
	public static final char[] SHUAN = {
		'栓','拴','闩','涮','汕','踹'};
	public static final char[] SHUANG = {
		'双','霜','爽','泷','孀','淙'};
	public static final char[] SHUI = {
		'水','谁','睡','税','说','氵'};
	public static final char[] SHUN = {
		'顺','吮','瞬','舜','俊','巛','巡','恂'};
	public static final char[] SHUO = {
		'说','数','硕','烁','朔','搠','妁','槊','蒴','铄','嗍','嗽','溯','濯','药'};
	public static final char[] SHW = {
	'折'};
	public static final char[] SI = {
		'四','死','丝','撕','似','私','嘶','思','寺','司','斯','食','伺','厕','肆','饲','嗣','巳','耜','驷','兕','蛳','厮','汜','锶','泗','笥','咝','鸶','姒','厶','缌','祀','澌','俟','以','台','徙','析','祠','糸','纟','肄','菥','雉','饴'};
	public static final char[] SONG = {
		'送','松','耸','宋','颂','诵','怂','讼','竦','菘','淞','悚','嵩','凇','崧','忪','锶'};
	public static final char[] SOU = {
		'艘','搜','擞','嗽','嗾','嗖','飕','叟','薮','锼','馊','瞍','溲','螋','敕','族','涑'};
	public static final char[] SU = {
		'素','速','诉','塑','宿','俗','苏','肃','粟','酥','缩','溯','僳','愫','簌','觫','稣','夙','嗉','谡','蔌','涑','嗖','搬'};
	public static final char[] SUAN = {
		'酸','算','蒜','狻','撰','选'};
	public static final char[] SUI = {
		'岁','随','碎','虽','穗','遂','尿','隋','髓','绥','隧','祟','眭','谇','濉','邃','燧','荽','睢','粹','莎','蓑','遗'};
	public static final char[] SUN = {
		'孙','损','笋','榫','荪','飧','狲','隼','树','跣','餐'};
	public static final char[] SUO = {
		'所','缩','锁','琐','索','梭','蓑','莎','唆','挲','睃','嗍','唢','桫','嗦','娑','羧','些','岁','抄','沙','牺','衰','逡','霍'};
	public static final char[] TA = {
		'他','她','它','踏','塔','塌','拓','獭','挞','蹋','溻','趿','鳎','沓','榻','漯','遢','铊','闼','嗒','太','搭','湿','达','鞑'};
	public static final char[] TAI = {
		'太','抬','台','态','胎','苔','泰','酞','汰','炱','肽','跆','呔','鲐','钛','薹','邰','骀','大','能','诒'};
	public static final char[] TAN = {
		'谈','叹','探','滩','弹','碳','摊','潭','贪','坛','痰','毯','坦','炭','瘫','谭','坍','檀','袒','钽','郯','镡','锬','覃','澹','昙','忐','但','掸','沈','淡','湛','炎','胆','舔','荨','蕈','赕'};
	public static final char[] TANG = {
		'躺','趟','堂','糖','汤','塘','烫','倘','淌','唐','搪','棠','膛','螳','樘','羰','醣','瑭','镗','傥','饧','溏','耥','帑','铴','螗','弹','扩','荡','铛','阊'};
	public static final char[] TAO = {
		'套','掏','逃','桃','讨','淘','涛','滔','陶','绦','萄','鼗','洮','焘','啕','饕','韬','叨','姚','挑','筹','绸','跳'};
	public static final char[] TE = {
		'特','慝','铽','忑','忒','匿','式','贷'};
	public static final char[] TEI = {
	'忒'};
	public static final char[] TENG = {
		'疼','腾','藤','誊','滕'};
	public static final char[] TI = {
		'提','替','体','题','踢','蹄','剃','剔','梯','锑','啼','涕','嚏','惕','屉','醍','鹈','绨','缇','倜','裼','逖','荑','悌','弟','折','是','棣','狄','睇','肆','诋','谛','跃','达','锡'};
	public static final char[] TIAN = {
		'天','田','添','填','甜','舔','恬','腆','佃','掭','钿','阗','忝','殄','畋','典','吞','嗔','栝','沾','滇','甸','町','苫','蚕','蚺','锘','镇','颠'};
	public static final char[] TIAO = {
		'条','跳','挑','调','迢','眺','龆','笤','祧','蜩','髫','佻','窕','鲦','苕','粜','啁','姚','桃','稠','超','踔','铫'};
	public static final char[] TIE = {
		'铁','贴','帖','萜','餮','占','蝶','锇'};
	public static final char[] TING = {
		'听','停','挺','厅','亭','艇','庭','廷','烃','汀','町','莛','铤','葶','婷','蜓','梃','霆','奠'};
	public static final char[] TONG = {
		'同','通','痛','铜','桶','筒','捅','统','童','彤','桐','瞳','恫','侗','酮','潼','茼','仝','砼','峒','恸','佟','嗵','垌','僮','恿','洞','硐','艟','重'};
	public static final char[] TOU = {
		'头','偷','透','投','钭','骰','亠','愉','绣','谕','谙','逗'};
	public static final char[] TU = {
		'土','图','兔','涂','吐','秃','突','徒','凸','途','屠','酴','荼','钍','菟','堍','余','杜','跌'};
	public static final char[] TUAN = {
		'团','湍','疃','抟','彖','敦','税','鹑'};
	public static final char[] TUI = {
		'腿','推','退','褪','颓','蜕','煺','忒','弟','税','脱','追','馈'};
	public static final char[] TUN = {
		'吞','屯','褪','臀','囤','氽','饨','豚','暾','吨','吴','沌','炖','窀','纯','肫','逐'};
	public static final char[] TUO = {
		'拖','脱','托','妥','驮','拓','驼','椭','唾','鸵','陀','魄','橐','柝','跎','乇','坨','佗','庹','酡','柁','鼍','沱','箨','砣','他','它','惰','池','税','舄','蛇','说','迤','铊','隋'};
	public static final char[] WA = {
		'挖','瓦','蛙','哇','娃','洼','凹','袜','佤','娲','腽','污','鞋','鲑'};
	public static final char[] WAI = {
		'外','歪','崴','呙','夭'};
	public static final char[] WAN = {
		'完','万','晚','碗','玩','弯','挽','湾','丸','腕','宛','婉','烷','顽','豌','惋','娩','皖','蔓','莞','脘','蜿','绾','芄','琬','纨','剜','畹','菀','免','关','园','朊','箢','苋','贯'};
	public static final char[] WANG = {
		'望','忘','王','往','网','亡','枉','旺','汪','妄','芒','辋','魍','惘','罔','匡','尢','皇'};
	public static final char[] WEI = {
		'为','位','未','围','喂','胃','微','味','尾','伪','威','伟','卫','危','违','委','魏','唯','维','畏','惟','韦','巍','蔚','谓','尉','潍','纬','慰','桅','萎','苇','渭','遗','葳','帏','艉','鲔','娓','逶','闱','隈','沩','玮','涠','帷','崴','隗','诿','洧','偎','猥','猬','嵬','軎','韪','炜','煨','圩','薇','痿','倭','哙','囗','堤','岿','有','机','熨','猗','眭','立','芟','荽','萏','阢','隹'};
	public static final char[] WEN = {
		'问','文','闻','稳','温','吻','蚊','纹','瘟','紊','汶','阌','刎','雯','璺','免','娩','愠','昧','殁','眼','笏','蕴','限','韫'};
	public static final char[] WENG = {
		'翁','嗡','瓮','蕹','蓊','壅','蒙'};
	public static final char[] WO = {
		'我','握','窝','卧','挝','沃','蜗','涡','斡','倭','幄','龌','肟','莴','喔','渥','硪','嗌','埚','夭','媪','杌','瘟'};
	public static final char[] WU = {
		'无','五','屋','物','舞','雾','误','捂','污','悟','勿','钨','武','戊','务','呜','伍','吴','午','吾','侮','乌','毋','恶','诬','芜','巫','晤','梧','坞','妩','蜈','牾','寤','兀','怃','阢','邬','唔','忤','骛','於','鋈','仵','杌','鹜','婺','迕','痦','芴','焐','庑','鹉','鼯','浯','圬','亡','仡','侉','喔','垭','御','旄','母','渥','瞀','笏','莫','蝥','龉'};
	public static final char[] XI = {
		'西','洗','细','吸','戏','系','喜','席','稀','溪','熄','锡','膝','息','袭','惜','习','嘻','夕','悉','矽','熙','希','檄','牺','晰','昔','媳','硒','铣','烯','腊','析','隙','栖','汐','犀','蜥','奚','浠','葸','饩','屣','玺','嬉','禊','兮','翕','穸','禧','僖','淅','蓰','舾','蹊','醯','郗','欷','皙','蟋','羲','茜','徙','隰','唏','曦','螅','歙','樨','阋','粞','熹','觋','菥','鼷','裼','舄','义','咦','咭','屎','撕','既','洒','湿','猎','胁','蜴','褶','诶','谥','郄','错','鳃'};
	public static final char[] XIA = {
		'下','吓','夏','峡','虾','瞎','霞','狭','匣','侠','辖','厦','暇','唬','狎','柙','呷','黠','硖','罅','遐','瑕','假','呀','哧','嗄','嗑','岈','押','歃','毳','浃','瘕','给','葭'};
	public static final char[] XIAN = {
		'先','线','县','现','显','掀','闲','献','嫌','陷','险','鲜','弦','衔','馅','限','咸','锨','仙','腺','贤','纤','宪','舷','涎','羡','铣','见','苋','藓','岘','痫','莶','籼','娴','蚬','猃','祆','冼','燹','跣','跹','酰','暹','氙','鹇','筅','霰','妗','姗','寰','彡','慊','捍','探','洒','洗','濂','省','矣','碱','笕','肩','胁','蔹','轩','钐','锬','阚','黹'};
	public static final char[] XIANG = {
		'想','向','象','项','响','香','乡','相','像','箱','巷','享','镶','厢','降','翔','祥','橡','详','湘','襄','飨','鲞','骧','蟓','庠','芗','饷','缃','葙','亨','攘','洋','舡'};
	public static final char[] 	XIAO = {
		'小','笑','消','削','销','萧','效','宵','晓','肖','孝','硝','淆','啸','霄','哮','嚣','校','魈','蛸','骁','枵','哓','崤','筱','潇','逍','枭','绡','箫','佼','俏','叟','号','呼','咻','哨','唠','唬','姣','挠','捎','搜','梢','爻','狡','绞','胶','芍','茭','较','骄','骚'};
	public static final char[] XIE = {
		'写','些','鞋','歇','斜','血','谢','卸','挟','屑','蟹','泻','懈','泄','楔','邪','协','械','谐','蝎','携','胁','解','契','叶','绁','颉','缬','獬','榭','廨','撷','偕','瀣','渫','亵','榍','邂','薤','躞','燮','勰','唏','喈','接','摺','桔','歙','汁','溃','溉','眭','耶','谍','豫','跬','迦','隰','页','骱','鲑'};
	public static final char[] XIN = {
		'新','心','欣','信','芯','薪','锌','辛','寻','衅','忻','歆','囟','莘','镡','馨','鑫','昕','兴','忄','款'};
	public static final char[] XING = {
		'性','行','型','形','星','醒','姓','腥','刑','杏','兴','幸','邢','猩','惺','省','硎','悻','荥','陉','擤','荇','研','胜','饧'};
	public static final char[] XIONG = {
		'胸','雄','凶','兄','熊','汹','匈','芎','宪'};
	public static final char[] XIU = {
		'修','锈','绣','休','羞','宿','嗅','袖','秀','朽','臭','溴','貅','馐','髹','鸺','咻','庥','岫','煦','莠'};
	public static final char[] XU = {
		'许','须','需','虚','嘘','蓄','续','序','叙','畜','絮','婿','戌','徐','旭','绪','吁','酗','恤','墟','糈','勖','栩','浒','蓿','顼','圩','洫','胥','醑','诩','溆','煦','盱','砉','于','休','余','呕','呼','咻','嗅','姐','怵','旮','朐','肷','芋','规','讴','邪','雩','馘'};
	public static final char[] XUAN = {
		'选','悬','旋','玄','宣','喧','轩','绚','眩','癣','券','暄','楦','儇','渲','漩','泫','铉','璇','煊','碹','镟','炫','揎','萱','痃','谖','亘','撰','擐','暖','洵','涓','绢','馔'};
	public static final char[] XUE = {
		'学','雪','血','靴','穴','削','薛','踅','噱','鳕','泶','决','哮','嚯','炔','谑'};
	public static final char[] XUN = {
		'寻','讯','熏','训','循','殉','旬','巡','迅','驯','汛','逊','勋','荤','询','浚','巽','鲟','浔','埙','恂','獯','醺','洵','郇','峋','蕈','薰','荀','窨','曛','徇','孙','悛','梭','洒','潭','狻','绚','荨','逡','遁','鑫'};
	public static final char[] YA = {
		'呀','压','牙','押','芽','鸭','轧','崖','哑','亚','涯','丫','雅','衙','鸦','讶','蚜','垭','疋','砑','琊','桠','睚','娅','痖','岈','氩','伢','迓','揠','厌','吖','吾','御','札','歇','碣','辂','邪','闸','颜','鹌'};
	public static final char[] YAN = {
		'眼','烟','沿','盐','言','演','严','咽','淹','炎','掩','厌','宴','岩','研','延','堰','验','艳','殷','阉','砚','雁','唁','彦','焰','蜒','衍','谚','燕','颜','阎','铅','焉','奄','芫','厣','阏','菸','魇','琰','滟','焱','赝','筵','腌','兖','剡','餍','恹','罨','檐','湮','偃','谳','胭','晏','闫','俨','郾','酽','鄢','妍','鼹','崦','阽','嫣','但','俺','厂','埏','埯','夏','巡','广','庵','揞','氤','洇','涎','淡','淫','狠','羡','莶','蔫','覃','讠','趼','这','锬','险','靥'};
	public static final char[] YANG = {
		'样','养','羊','洋','仰','扬','秧','氧','痒','杨','漾','阳','殃','央','鸯','佯','疡','炀','恙','徉','鞅','泱','蛘','烊','怏','昂','映','英','详'};
	public static final char[] YAO = {
		'要','摇','药','咬','腰','窑','舀','邀','妖','谣','遥','姚','瑶','耀','尧','钥','侥','陶','约','疟','珧','夭','鳐','鹞','轺','爻','吆','铫','幺','崾','肴','曜','徭','杳','窈','么','乐','啮','娆','幼','洮','淫','瀹','由','繇','荛','骜'};
	public static final char[] YE = {
		'也','夜','业','野','叶','爷','页','液','掖','腋','冶','噎','耶','咽','曳','椰','邪','谒','邺','晔','烨','揶','铘','靥','喝','墅','射','拽','揞','揲','斜','洇','涂','聂','荼','馀'};
	public static final char[] YI = {
		'一','以','已','亿','衣','移','依','易','医','乙','仪','亦','椅','益','倚','姨','翼','译','伊','蛇','遗','食','艾','胰','疑','沂','宜','异','彝','壹','蚁','谊','揖','铱','矣','翌','艺','抑','绎','邑','蛾','屹','尾','役','臆','逸','肄','疫','颐','裔','意','毅','忆','义','夷','溢','诣','议','怿','痍','镒','癔','怡','驿','旖','熠','酏','翊','欹','峄','圯','殪','嗌','咦','懿','噫','劓','诒','饴','漪','佚','咿','瘗','猗','眙','羿','弈','苡','荑','仡','佾','贻','钇','缢','迤','刈','悒','黟','翳','弋','奕','蜴','埸','挹','嶷','薏','呓','轶','镱','舣','丿','也','佗','印','台','叹','听','噎','圪','坨','夕','失','奇','姬','它','射','崎','巳','因','引','印','银','音','饮','阴','隐','荫','吟','尹','寅','茵','淫','殷','姻','烟','堙','鄞','喑','夤','胤','龈','吲','圻','狺','垠','霪','蚓','氤'};
	public static final char[] YIN = {
		'因','引','印','银','音','饮','阴','隐','荫','吟','尹','寅','茵','淫','殷','姻','烟','堙','鄞','喑','夤','胤','龈','吲','圻','狺','垠','霪','蚓','氤','铟','窨','瘾','洇','茚','众','听','垦','壹','币','廴','沂','浔','潭','芩','言'};
	public static final char[] YING = {
		'应','硬','影','营','迎','映','蝇','赢','鹰','英','颖','莹','盈','婴','樱','缨','荧','萤','萦','楹','蓥','瘿','茔','鹦','媵','莺','璎','郢','嘤','撄','瑛','滢','潆','嬴','罂','瀛','膺','荥','颍','哽','央','景','甸','绳','逞'};
	public static final char[] YO = {
		'哟','育','唷'};
	public static final char[] YONG = {
		'用','涌','永','拥','蛹','勇','雍','咏','泳','佣','踊','痈','庸','臃','恿','壅','慵','俑','墉','鳙','邕','喁','甬','饔','镛','容','臾','蕹','遇'};
	public static final char[] YOU = {
		'有','又','由','右','油','游','幼','优','友','铀','忧','尤','犹','诱','悠','邮','酉','佑','釉','幽','疣','攸','蚰','莠','鱿','卣','黝','莸','猷','蚴','宥','牖','囿','柚','蝣','莜','鼬','铕','蝤','繇','呦','侑','叹','坳','奥','尢','扰','揄','泅','聱','锈'};
	public static final char[] YU = {
		'与','于','欲','鱼','雨','余','遇','语','愈','狱','玉','渔','予','誉','育','愚','羽','虞','娱','淤','舆','屿','禹','宇','迂','俞','逾','域','芋','郁','谷','吁','盂','喻','峪','御','愉','粥','渝','尉','榆','隅','浴','寓','裕','预','豫','驭','蔚','妪','嵛','雩','馀','阈','窬','鹆','妤','揄','窳','觎','臾','舁','龉','蓣','煜','钰','谀','纡','於','竽','瑜','禺','聿','欤','俣','伛','圄','鹬','庾','昱','萸','瘐','谕','鬻','圉','瘀','熨','饫','毓','燠','腴','狳','菀','蜮','蝓','亏','吾','唷','喁','噢','夕','奥','宛','崛','懊','或','拗','昙','栩','梧','污','汩','澳','煨','王','腧','舒','苑','菸','蜍','衙','阏'};
	public static final char[] 	YUAN = {
		'远','员','元','院','圆','原','愿','园','援','猿','怨','冤','源','缘','袁','渊','苑','垣','鸳','辕','圜','鼋','橼','媛','爰','眢','鸢','掾','芫','沅','瑗','螈','箢','塬','垸','允','咽','宛','捐','涓','穿','阮','陨'};
	public static final char[] YUE = {
		'月','越','约','跃','阅','乐','岳','悦','曰','说','粤','钥','瀹','钺','刖','龠','栎','樾','哕','囝','块','妁','烁','药','蜕','蠖','跞','铄','锐'};
	public static final char[] YUN = {
		'云','运','晕','允','匀','韵','陨','孕','耘','蕴','酝','郧','员','氲','恽','愠','郓','芸','筠','韫','昀','狁','殒','纭','熨','均','媪','尉','尹','怨','温','瘟','盾','苑','菀'};
	public static final char[] ZA = {
		'杂','砸','咋','匝','扎','咱','咂','拶','啐','嘁','籴'};
	public static final char[] ZAI = {
		'在','再','灾','载','栽','宰','哉','甾','崽','仔','才'};
	public static final char[] ZAN = {
		'咱','暂','攒','赞','簪','趱','糌','瓒','拶','昝','錾','涔','湔'};
	public static final char[] ZANG = {
		'脏','葬','赃','藏','奘','臧','驵','戕'};
	public static final char[] ZAO = {
		'早','造','遭','糟','灶','燥','枣','凿','躁','藻','皂','噪','澡','蚤','唣','槽','窖','缫','缲','草'};
	public static final char[] ZE = {
		'则','责','择','泽','咋','侧','箦','舴','帻','迮','啧','仄','昃','笮','赜','厕','措','柞','稷','谪'};
	public static final char[] ZEI = {
		'贼','鲫'};
	public static final char[] ZEN = {
		'怎','谮','僭'};
	public static final char[] ZENG = {
		'增','赠','憎','曾','综','缯','罾','甑','锃'};
	public static final char[] ZHA = {
		'扎','炸','渣','闸','眨','榨','乍','轧','诈','铡','札','蜡','查','栅','咋','喳','砟','痄','吒','哳','楂','猹','蚱','揸','喋','柞','咤','齄','册','哆','怍','插','渫','笮','膪','苴','鲽','龃'};
	public static final char[] ZHAI = {
		'摘','窄','债','斋','寨','择','翟','宅','侧','祭','砦','瘵','度','柴','疵','箦','膪','责','骀'};
	public static final char[] ZHAN = {
		'站','占','战','盏','沾','粘','毡','展','栈','詹','颤','蘸','湛','绽','斩','辗','崭','瞻','谵','搌','旃','湔','澶','袒','谦','躔','醮','骣'};
	public static final char[] ZHANG = {
		'张','章','长','帐','仗','丈','掌','涨','账','樟','杖','彰','漳','胀','瘴','障','仉','嫜','幛','鄣','璋','嶂','獐','蟑','承'};
	public static final char[] ZHAO = {
		'找','着','照','招','罩','爪','兆','朝','昭','沼','肇','嘲','召','赵','棹','啁','钊','笊','诏','晁','桃','淖','濯','著','蚤'};
	public static final char[] ZHE = {
		'着','这','者','折','遮','蛰','哲','蔗','锗','辙','浙','柘','辄','赭','摺','鹧','磔','褶','蜇','谪','乇','嗫','嘀','堵','庶','摄','斥','耷','聂','褚','轶','陬','鸷'};
	public static final char[] ZHEI = {
	'这'};
	public static final char[] ZHEN = {
		'真','阵','镇','针','震','枕','振','斟','珍','疹','诊','甄','砧','臻','贞','侦','缜','蓁','祯','箴','轸','榛','稹','赈','朕','鸩','胗','浈','桢','畛','圳','椹','唇','坫','填','慎','戡','溱','滇','趁','鲞','鼎'};
	public static final char[] ZHENG = {
		'正','整','睁','争','挣','征','怔','证','帧','症','郑','拯','丁','蒸','狰','政','峥','钲','铮','筝','诤','徵','鲭','丞','伥','承','敞','止','町','瞠','趟'};
	public static final char[] ZHI = {
		'只','之','直','知','制','指','纸','支','芝','枝','稚','吱','蜘','质','肢','脂','汁','炙','织','职','痔','植','抵','殖','执','值','侄','址','滞','止','趾','治','旨','窒','志','挚','掷','至','致','置','帜','识','峙','氏','智','秩','帙','摭','黹','桎','枳','轵','忮','祉','蛭','膣','觯','郅','栀','彘','芷','祗','咫','鸷','絷','踬','胝','骘','轾','痣','陟','踯','雉','埴','贽','卮','酯','豸','跖','栉','伎','埃','夂','多','实','徵','恃','拓','昵','栽','氐','示','祁','积','耆','迟','郦','铁','鸠'};
	public static final char[] ZHONG = {
		'中','重','种','钟','肿','众','终','盅','忠','仲','衷','踵','舯','螽','锺','冢','忪','夂','潼','童','舂','董','蚣'};
	public static final char[] ZHOU = {
		'周','洲','皱','粥','州','轴','舟','昼','骤','宙','诌','肘','帚','咒','繇','胄','纣','荮','啁','碡','绉','籀','妯','酎','侏','倜','啄','喙','府','扭','柚','注','祝','舳','诹','调','逐','铀','驺','鬻',
		'住','主','猪','竹','株','煮','筑','著','贮','铸','嘱','拄','注','祝','驻','属','术','珠','瞩','蛛','朱','柱','诸','诛','逐','助','烛','蛀','潴','洙','伫','瘃','翥','茱','苎','橥','舳','杼','箸','炷','侏','铢','疰','渚','褚','躅','麈','邾','槠','竺','丶','予','宁','庶','斗','朝','柠','楮','泞','澍','茁','蚰','逗','阻','除','驺'};
	public static final char[] ZHU = {
		'住','主','猪','竹','株','煮','筑','著','贮','铸','嘱','拄','注','祝','驻','属','术','珠','瞩','蛛','朱','柱','诸','诛','逐','助','烛','蛀','潴','洙','伫','瘃','翥','茱','苎','橥','舳','杼','箸','炷','侏','铢','疰','渚','褚','躅','麈','邾','槠','竺','丶','予','宁','庶','斗','朝','柠','楮','泞','澍','茁','蚰','逗','阻','除','驺'};
	public static final char[] ZHUA = {
		'抓','爪','挝'};
	public static final char[] ZHUAI = {
		'拽','转'};
	public static final char[] ZHUAN = {
		'转','专','砖','赚','传','撰','篆','颛','馔','啭','沌','抟','湍'};
	public static final char[] ZHUANG = {
		'装','撞','庄','壮','桩','状','幢','妆','僮','奘','戆','丬','憧','艟','赣'};
	public static final char[] ZHUI = {
		'追','坠','缀','锥','赘','椎','骓','惴','缒','隹','垂','揣','槌','致','萑','隧'};
	public static final char[] ZHUN = {
		'准','谆','屯','肫','窀','淳','盹','纯','胗','饨'};
	public static final char[] ZHUO = {
		'捉','桌','着','啄','拙','灼','浊','卓','琢','缴','茁','酌','擢','焯','濯','诼','浞','涿','倬','镯','禚','斫','勺','啜','掇','杓','棹','淖','箸','肫','著','蕞','趵','踔','躅'};
	public static final char[] ZI = {
		'字','自','子','紫','籽','资','姿','吱','滓','仔','兹','咨','孜','渍','滋','淄','笫','粢','龇','秭','恣','谘','趑','缁','梓','鲻','锱','孳','耔','觜','髭','赀','茈','訾','嵫','眦','姊','辎','事','呲','次','甾','疵','载','锌','齐'};
	public static final char[] ZONG = {
		'总','纵','宗','棕','综','踪','鬃','偬','粽','枞','腙'};
	public static final char[] ZOU = {
		'走','揍','奏','邹','鲰','鄹','陬','驺','诹','族','楱'};
	public static final char[] ZU = {
		'组','族','足','阻','租','祖','诅','菹','镞','卒','俎','啐','嘁','徂','沮','淬','苴','趱','蹴','驵'};
	public static final char[] ZUAN = {
		'钻','纂','赚','缵','躜','攥','撮','攒'};
	public static final char[] ZUI = {
		'最','嘴','醉','罪','堆','咀','觜','蕞','摧','撮','羧'};
	public static final char[] ZUN = {
		'尊','遵','鳟','撙','樽','奠','蹲'};
	public static final char[] ZUO = {
		'做','作','坐','左','座','昨','凿','琢','撮','佐','笮','嘬','酢','唑','祚','胙','怍','阼','柞','乍','挫','砟','醋'};
}
