package cn.sda.pinyin;
public class CharsLibrary_2{
	private CharsLibrary_2()
	{
	}
	public static final char[] LA = {
		'拉','啦','辣','蜡','腊','喇','垃','蓝','落','瘌','邋','砬','剌','旯','摺'};
	public static final char[] LAI = {
		'来','赖','莱','濑','赉','崃','涞','铼','籁','徕','癞','睐','黧'};
	public static final char[] LAN = {
		'蓝','兰','烂','拦','篮','懒','栏','揽','缆','滥','阑','谰','婪','澜','览','榄','岚','褴','镧','斓','罱','漤','啉','廪','懔','涟','炼','谏','郴'};
	public static final char[] LANG = {
		'浪','狼','廊','郎','朗','榔','琅','稂','螂','莨','啷','锒','阆','蒗','羹','踉'};
	public static final char[] LAO = {
		'老','捞','牢','劳','烙','涝','落','姥','酪','络','佬','潦','耢','铹','醪','铑','唠','栳','崂','痨','僚','撩','獠','蓼'};
	public static final char[] LE = {
		'了','乐','勒','肋','鳓','仂','叻','泐','嘞'};
	public static final char[] LEI = {
		'类','累','泪','雷','垒','勒','擂','蕾','肋','镭','儡','磊','缧','诔','耒','酹','羸','嫘','檑','嘞','卢','咧','漯'};
	public static final char[] LEN = {
	'啉'};
	public static final char[] LENG = {
		'冷','棱','楞','愣','塄'};
	public static final char[] LI = {
		'里','离','力','立','李','例','哩','理','利','梨','厘','礼','历','丽','吏','砾','漓','莉','傈','荔','俐','痢','狸','粒','沥','隶','栗','璃','鲤','厉','励','犁','黎','篱','郦','鹂','笠','坜','苈','鳢','缡','跞','蜊','锂','悝','澧','粝','蓠','枥','蠡','鬲','呖','砺','嫠','篥','疠','疬','猁','藜','溧','鲡','戾','栎','唳','醴','轹','詈','骊','罹','逦','俪','喱','雳','黧','莅','俚','蛎','娌','仂','位','列','叻','捩','泣','珞','砬','硌','翮','铄','镉','霾','飒'};
	public static final char[] LIA = {
	'俩'};
	public static final char[] LIAN = {
		'连','联','练','莲','恋','脸','炼','链','敛','怜','廉','帘','镰','涟','蠊','琏','殓','蔹','鲢','奁','潋','臁','裢','濂','裣','楝','令','娈','挛','搛','瞵','羸','膦','苓','莶','镧','零'};
	public static final char[] LIANG = {
		'两','亮','辆','凉','粮','梁','量','良','晾','谅','俩','粱','墚','靓','踉','椋','魉','莨','惊','蹒','阆'};
	public static final char[] LIAO = {
		'了','料','撩','聊','撂','疗','廖','燎','辽','僚','寥','镣','潦','钌','蓼','尥','寮','缭','獠','鹩','嘹','佬','劳'};
	public static final char[] LIE = {
		'列','裂','猎','劣','烈','咧','埒','捩','鬣','趔','躐','冽','洌','例','栗','膊','邋'};
	public static final char[] LIN = {
		'林','临','淋','邻','磷','鳞','赁','吝','拎','琳','霖','凛','遴','嶙','蔺','粼','麟','躏','辚','廪','懔','瞵','檩','膦','啉','任','渗','阴'};
	public static final char[] LING = {
		'另','令','领','零','铃','玲','灵','岭','龄','凌','陵','菱','伶','羚','棱','翎','蛉','苓','绫','瓴','酃','呤','泠','棂','柃','鲮','聆','囹','冷','怜','拎','磷','钉'};
	public static final char[] LIU = {
		'六','流','留','刘','柳','溜','硫','瘤','榴','琉','馏','碌','陆','绺','锍','鎏','镏','浏','骝','旒','鹨','熘','遛','偻','抡','泖','泵','游','聊','蒌','蓼','铆'};
	public static final char[] LO= {
	'咯'};
	public static final char[] LONG = {
		'龙','拢','笼','聋','隆','垄','弄','咙','窿','陇','垅','胧','珑','茏','泷','栊','癃','砻','宠','庞','总'};
	public static final char[] LOU = {
		'楼','搂','漏','陋','露','娄','篓','偻','蝼','镂','蒌','耧','髅','喽','瘘','嵝','牢'};
	public static final char[] LU = {
		'路','露','录','鹿','陆','炉','卢','鲁','卤','芦','颅','庐','碌','掳','绿','虏','赂','戮','潞','禄','麓','六','鲈','栌','渌','蓼','逯','泸','轳','氇','簏','橹','辂','垆','胪','噜','镥','辘','漉','撸','璐','鸬','鹭','舻','捋','摅','滤','瘳','肤','角','谷','酪'};
	public static final char[] LUAN = {
		'乱','卵','滦','峦','孪','挛','栾','銮','脔','娈','鸾'};
	public static final char[] LUE = {
		'略','掠','锊','率','药'};
	public static final char[] LUN = {
		'论','轮','抡','伦','沦','仑','纶','囵'};
	public static final char[] LUO = {
		'落','罗','锣','裸','骡','烙','箩','螺','萝','洛','骆','逻','络','咯','荦','漯','蠃','雒','倮','硌','椤','捋','脶','瘰','摞','泺','珞','镙','猡','乐','果','格','橐','烁','猓','碌','蜾','蠡','袼','跞','路','铬'};
	public static final char[] LV = {
		'绿','率','铝','驴','旅','屡','滤','吕','律','氯','缕','侣','虑','履','偻','膂','榈','闾','捋','褛','稆','卢','娄','庐','篓','累','蒌','镂','鲁','鹿'};
	public static final char[] M = {
	'呒'};
	public static final char[] MA = {
		'吗','妈','马','嘛','麻','骂','抹','码','玛','蚂','摩','唛','蟆','犸','嬷','杩','么','呐','蓦','貉','貊','靡','麽'};
	public static final char[] MAI = {
		'买','卖','迈','埋','麦','脉','劢','霾','荬','咪','哩','派'};
	public static final char[] MAN = {
		'满','慢','瞒','漫','蛮','蔓','曼','馒','埋','谩','幔','鳗','墁','螨','镘','颟','鞔','缦','熳','幕','蹒'};
	public static final char[] MANG = {
		'忙','芒','盲','莽','茫','氓','硭','邙','蟒','漭','朦','瞢','龙'};
	public static final char[] MAO = {
		'毛','冒','帽','猫','矛','卯','貌','茂','贸','铆','锚','茅','耄','茆','瑁','蝥','髦','懋','昴','牦','瞀','峁','袤','蟊','旄','泖','侔','勖','描','牟','耗','蛑'};
	public static final char[] ME = {
		'么','麽'};
	public static final char[] MEI = {
		'没','每','煤','镁','美','酶','妹','枚','霉','玫','眉','梅','寐','昧','媒','糜','媚','谜','沫','嵋','猸','袂','湄','浼','鹛','莓','魅','镅','楣','味','坶','墨','某'};
	public static final char[] MEN = {
		'门','们','闷','懑','扪','钔','焖','汶','满','玟','鞔'};
	public static final char[] MENG = {
		'猛','梦','蒙','锰','孟','盟','檬','萌','氓','礞','蜢','勐','懵','甍','蠓','虻','朦','艋','艨','瞢','明','瞑','蟊','蟒','黾'};
	public static final char[] MI = {
		'米','密','迷','眯','蜜','谜','觅','秘','弥','幂','靡','糜','泌','醚','蘼','縻','咪','汨','麋','祢','猕','弭','谧','芈','脒','宓','敉','嘧','糸','冖','尔','幺','摩','溟','獯','辟'};
	public static final char[] MIAN = {
		'面','棉','免','绵','眠','缅','勉','冕','娩','腼','湎','眄','沔','黾','渑','冥','宀','泯','瞑','缗'};
	public static final char[] MIAO = {
		'秒','苗','庙','妙','描','瞄','藐','渺','眇','缪','缈','淼','喵','杪','鹋','邈','吵','猫','纱','蜱'};
	public static final char[] MIE = {
		'灭','蔑','咩','篾','蠛','乜','咪','谂'};
	public static final char[] MIN = {
		'民','抿','敏','闽','皿','悯','珉','愍','缗','闵','玟','苠','泯','黾','鳘','岷','汶','眠','绳'};
	public static final char[] MING = {
		'名','明','命','鸣','铭','螟','盟','冥','瞑','暝','茗','溟','酩','萌'};
	public static final char[] MIU = {
		'谬','缪'};
	public static final char[] MO = {
		'摸','磨','抹','末','膜','墨','没','莫','默','魔','模','摩','摹','漠','陌','蘑','脉','沫','万','无','嘿','冒','寞','秣','瘼','殁','镆','嫫','谟','蓦','貊','貘','麽','茉','馍','耱','么','伯','佰','勿','帕','抚','昧','百','藐','蟆','袜','貉','貌'};
	public static final char[] MOU = {
		'某','谋','牟','眸','蛑','鍪','侔','缪','哞','件','厶','婺','毋','袤'};
	public static final char[] MU = {
		'木','母','亩','幕','目','墓','牧','牟','模','穆','暮','牡','拇','募','慕','睦','姆','姥','钼','毪','坶','沐','仫','苜','嘿','婺','缪'};
	public static final char[] N = {
		'嗯','哏'};
	public static final char[] NA = {
		'那','拿','哪','纳','钠','娜','呐','南','衲','捺','镎','肭','内','呶','箬','絮'};
	public static final char[] NAI = {
		'乃','耐','奶','奈','氖','哪','萘','艿','柰','鼐','佴','能'};
	public static final char[] NAN = {
		'难','南','男','赧','囡','蝻','楠','喃','腩','囝','摊','滩','颌'};
	public static final char[] NANG = {
		'囊','馕','曩','囔','攮','哝'};
	public static final char[] NAO = {
		'闹','脑','恼','挠','淖','孬','铙','瑙','垴','呶','蛲','猱','硇','浇'};
	public static final char[] NE = {
		'呢','哪','那','呐','讷','疒','疔'};
	public static final char[] NEI = {
		'内','哪','馁','那'};
	public static final char[] NEN = {
		'嫩','恁','枘'};
	public static final char[] NENG = {
		'能','而','耐'};
	public static final char[] NG = {
	'嗯'};
	public static final char[] NI = {
		'你','泥','拟','腻','逆','呢','溺','倪','尼','匿','妮','霓','铌','昵','坭','祢','猊','伲','怩','鲵','睨','旎','嶷','慝','滠'};
	public static final char[] NIAN = {
		'年','念','捻','撵','拈','碾','蔫','粘','廿','黏','辇','鲇','鲶','埝','趁','辗'};
	public static final char[] NIANG = {
		'娘','酿'};
	public static final char[] NIAO = {
		'鸟','尿','袅','茑','脲','嬲','尥','溺'};
	public static final char[] NIE = {
		'捏','镍','聂','孽','涅','镊','啮','陧','蘖','嗫','臬','蹑','颞','乜','倪','囡','埝','幸','捻','摄','肀'};
	public static final char[] NIN = {
		'您','恁'};
	public static final char[] NING = {
		'拧','凝','宁','柠','狞','泞','佞','甯','咛','聍','冰','年','攘','疑'};
	public static final char[] NIU = {
		'牛','扭','纽','钮','拗','妞','狃','忸','蚴'};
	public static final char[] NONG = {
		'弄','浓','农','脓','哝','侬','咔'};
	public static final char[] NOU = {
	'耨'};
	public static final char[] NU = {
		'怒','努','奴','孥','胬','驽','弩','仅','呶','帑','褥'};
	public static final char[] NUAN = {
		'暖','濡'};
	public static final char[] NUE = {
		'虐','疟','谑'};
	public static final char[] NUO = {
		'挪','诺','懦','糯','娜','喏','傩','锘','搦','呐','哪','掉','那','难','需'};
	public static final char[] NV = {
		'女','衄','钕','恧','狃','絮','肭'};
	public static final char[] NVE = {
		'疟','虐'};
	public static final char[] O = {
		'哦','喔','噢'};
	public static final char[] OU = {
		'偶','呕','欧','藕','鸥','区','沤','殴','怄','瓯','讴','耦','抠','握','渥','纡','遇'};
	public static final char[] PA = {
		'怕','爬','趴','啪','耙','扒','帕','琶','派','筢','杷','葩','叭','吧','把','芭','钯'};
	public static final char[] PAI = {
		'派','排','拍','牌','迫','徘','湃','哌','俳','蒎','啡','脾'};
	public static final char[] PAN = {
		'盘','盼','判','攀','畔','潘','叛','磐','番','般','胖','襻','蟠','袢','泮','拚','爿','蹒','伴','半','卞','姗','审','弁','彦','扳','拌','片','皤','繁','鄱'};
	public static final char[] PANG = {
		'旁','胖','耪','庞','乓','膀','磅','滂','彷','逄','螃','仿','傍','彭','房','方','蒡','逢','镑'};
	public static final char[] PAO = {
		'跑','抛','炮','泡','刨','袍','咆','狍','匏','庖','疱','脬','包','抱','胞','苞','飑','鲍'};
	public static final char[] PEI = {
		'陪','配','赔','呸','胚','佩','培','沛','裴','旆','锫','帔','醅','霈','辔','倍','啡','坏','妃','掊','淠','艴','茇','蜚'};
	public static final char[] PEN = {
		'喷','盆','湓','吩','本','汾'};
	public static final char[] PENG = {
		'碰','捧','棚','砰','蓬','朋','彭','鹏','烹','硼','膨','抨','澎','篷','怦','堋','蟛','嘭','亨','傍','庄','旁','滂','苹','迸','逢'};
	public static final char[] PI = {
		'批','皮','披','匹','劈','辟','坯','屁','脾','僻','疲','痞','霹','琵','毗','啤','譬','砒','否','貔','丕','圮','媲','癖','仳','擗','郫','甓','枇','睥','蜱','鼙','邳','吡','陂','铍','庀','罴','埤','纰','陴','淠','噼','蚍','裨','俾','副','卑','坏','培','帔','庇','庳','扑','拂','比','濞','疋','痦','篦','芘','苤','萆','蕃','蚌','被','鄱','钚','颇'};
	public static final char[] PIAN = {
		'片','篇','骗','偏','便','扁','翩','缏','犏','骈','胼','蹁','谝','平','蝙','褊','辩'};
	public static final char[] PIANPANG = {
		'疒','阝','肀','匚','纟','艹','虍','亠','廾','忄','彐','冂','亻','尢','宀','刂','灬','丶','扌','冫','攵','丨','礻','夂','饣','丿','屮','辶','冖','彡','钅','犭','囗','勹','卩','廴','衤','丬','凵','氵','讠'};
	public static final char[] PIAO = {
		'票','飘','漂','瓢','朴','螵','莩','嫖','瞟','殍','缥','嘌','骠','剽','膘','髟'};
	public static final char[] PIE = {
		'瞥','撇','氕','苤','丿','肺','蔽'};
	public static final char[] PIN = {
		'品','贫','聘','拼','频','嫔','榀','姘','牝','颦','匕','娉','拚','泵'};
	public static final char[] PING = {
		'平','凭','瓶','评','屏','乒','萍','苹','坪','冯','娉','鲆','枰','俜','砰','秤'};
	public static final char[] PO = {
		'破','坡','颇','婆','泼','迫','泊','魄','朴','繁','粕','笸','皤','钋','陂','鄱','攴','叵','珀','钷','溥','膊','跛','霸'};
	public static final char[] POU = {
		'剖','掊','裒','培','抱','涪','褒','踣','部','锫'};
	public static final char[] PU = {
		'扑','铺','谱','脯','仆','蒲','葡','朴','菩','曝','莆','瀑','埔','圃','浦','堡','普','暴','镨','噗','匍','溥','濮','氆','蹼','璞','镤','剥','卜','扶','攴','攵','甫','苻'};
	public static final char[] Q = {
	'瑁'};
	public static final char[] QI = {
		'起','其','七','气','期','齐','器','妻','骑','汽','棋','奇','欺','漆','启','戚','柒','岂','砌','弃','泣','祁','凄','企','乞','契','歧','祈','栖','畦','脐','崎','稽','迄','缉','沏','讫','旗','祺','颀','骐','屺','岐','蹊','萁','蕲','桤','憩','芪','荠','萋','芑','汔','亟','鳍','俟','槭','嘁','蛴','綦','亓','欹','琪','麒','琦','蜞','圻','杞','葺','碛','淇','祗','耆','绮','丌','伎','偈','切','刺','勤','吃','吱','宿','己','忮','忾','恝','技','抵','挈','揭','支','枝','济','渍','甭','畸','示','綮','趿','逗'};
	public static final char[] QIA = {
		'恰','卡','掐','洽','髂','袷','葜','咭','客','挈','疴','鲒'};
	public static final char[] QIAN = {
		'前','钱','千','牵','浅','签','欠','铅','嵌','钎','迁','钳','乾','谴','谦','潜','歉','纤','扦','遣','黔','堑','仟','岍','钤','褰','箝','掮','搴','倩','慊','悭','愆','虔','芡','荨','缱','佥','芊','阡','肷','茜','椠','犍','骞','凄','凵','寨','忏','撖','柑','涔','渐','湔','筋','羟','腱','赶','锓','鹣','龈'};
	public static final char[] QIANG = {
		'强','枪','墙','抢','腔','呛','羌','蔷','将','蜣','跄','戗','襁','戕','炝','镪','锖','锵','羟','樯','嫱','哐','庆','控','爿','箐','跫'};
	public static final char[] QIAO = {
		'桥','瞧','敲','巧','翘','锹','壳','鞘','撬','悄','俏','窍','雀','乔','侨','峭','橇','樵','荞','跷','硗','憔','谯','鞒','愀','缲','诮','劁','削','峤','愁','招','捎','搞','敫','校','毳','焦','硝','茭','蕉','跤','醮','铫','骄'};
	public static final char[] QIE = {
		'切','且','怯','窃','茄','砌','郄','趄','惬','锲','妾','箧','慊','伽','挈','唼','喋','契','婕','捷','沏','漆','脞','蕺','鲽'};
	public static final char[] QIN = {
		'亲','琴','侵','勤','擒','寝','秦','芹','沁','禽','钦','吣','覃','矜','衾','芩','溱','廑','嗪','螓','噙','揿','檎','锓','堇','槿','浸','渗','蓁','蕲','衿','颌'};
	public static final char[] QING = {
		'请','轻','清','青','情','晴','氢','倾','庆','擎','顷','亲','卿','氰','圊','謦','檠','箐','苘','蜻','黥','罄','鲭','磬','綮','倩','声','精','胜'};
	public static final char[] QIONG = {
		'穷','琼','跫','穹','邛','蛩','茕','銎','筇','鞠'};
	public static final char[] QIU = {
		'求','球','秋','丘','泅','仇','邱','囚','酋','龟','楸','蚯','裘','糗','蝤','巯','逑','俅','虬','赇','鳅','犰','湫','鼽','遒','区','团','宿','惆','愀','氽','艽','邺','钆','馗','鸠'};
	public static final char[] QU = {
		'去','取','区','娶','渠','曲','趋','趣','屈','驱','蛆','躯','龋','戌','蠼','蘧','祛','蕖','磲','劬','诎','鸲','阒','麴','癯','衢','黢','璩','氍','觑','蛐','朐','瞿','岖','苣','句','巨','组','蜡','遽','鞠','鞫','驺'};
	public static final char[] QUAN = {
		'全','权','劝','圈','拳','犬','泉','券','颧','痊','醛','铨','筌','绻','诠','辁','畎','鬈','悛','蜷','荃','卷','圳','拴','桊','犭','獾','纯','鹳'};
	public static final char[] QUE = {
		'却','缺','确','雀','瘸','鹊','炔','榷','阙','阕','悫','决','屈','攉','猎','舄','芍','鸟'};
	public static final char[] QUN = {
		'群','裙','麇','逡','遁'};
	public static final char[] RAN = {
		'染','燃','然','冉','髯','苒','蚺'};
	public static final char[] RANG = {
		'让','嚷','瓤','攘','壤','穰','禳','镶'};
	public static final char[] RAO = {
		'饶','绕','扰','荛','桡','娆','挠','缭'};
	public static final char[] RE = {
		'热','若','惹','喏','偌'};
	public static final char[] REN = {
		'人','任','忍','认','刃','仁','韧','妊','纫','壬','饪','轫','仞','荏','葚','衽','稔','亻','儿','恁'};
	public static final char[] RENG = {
		'仍','扔','戎','穰','耳','艿'};
	public static final char[] RI = {
	'日'};
	public static final char[] RONG = {
		'容','绒','融','溶','熔','荣','戎','蓉','冗','茸','榕','狨','嵘','肜','蝾','缛','隔','颂'};
	public static final char[] ROU = {
		'肉','揉','柔','糅','蹂','鞣'};
	public static final char[] RU = {
		'如','入','汝','儒','茹','乳','褥','辱','蠕','孺','蓐','襦','铷','嚅','缛','濡','薷','颥','溽','洳','女','月','肉','需'};
	public static final char[] RUAN = {
		'软','阮','朊','濡','需'};
	public static final char[] RUI = {
		'瑞','蕊','锐','睿','芮','蚋','枘','蕤','兑','内','绥','钠'};
	public static final char[] RUN = {
		'润','闰'};
	public static final char[] RUO = {
		'若','弱','箬','偌','惹','溺','芮'};
	public static final char[] SA = {
		'撒','洒','萨','挲','仨','卅','飒','脎','檫','蔡'};
	public static final char[] SAI = {
		'塞','腮','鳃','思','赛','噻'};
	public static final char[] SAN = {
		'三','散','伞','叁','馓','糁','毵','霰','参'};
	public static final char[] SANG = {
		'桑','丧','嗓','颡','磉','搡'};
	public static final char[] SAO = {
		'扫','嫂','搔','骚','梢','埽','鳋','臊','缫','瘙','哨','燥','缲'};
	public static final char[] SE = {
		'色','涩','瑟','塞','啬','铯','穑','寨','槭','泣','渍','蔷','铋','铩'};
	public static final char[] SEN = {
		'森','掺','渗'};
	public static final char[] SENG = {
	'僧'};
	public static final char[] SHA = {
		'杀','沙','啥','纱','傻','砂','刹','莎','厦','煞','杉','嗄','唼','鲨','霎','铩','痧','裟','挲','歃','噎','接','摄','赊'};
	public static final char[] SHAI = {
		'晒','筛','色','酾'};
	public static final char[] SHAN = {
		'山','闪','衫','善','扇','杉','删','煽','单','珊','掺','赡','栅','苫','掸','膳','陕','汕','擅','缮','嬗','蟮','芟','禅','跚','鄯','潸','鳝','姗','剡','骟','疝','膻','讪','钐','舢','埏','儋','彡','搀','檀','澹','邓','颤','髟'};
	public static final char[] SHANG = {
		'上','伤','尚','商','赏','晌','墒','汤','裳','熵','觞','绱','殇','垧','场'};
	public static final char[] SHAO = {
		'少','烧','捎','哨','勺','梢','稍','邵','韶','绍','芍','召','鞘','苕','劭','潲','艄','蛸','筲','削','招','搜','溲','笤','绡'};
	public static final char[] SHE = {
		'社','射','蛇','设','舌','摄','舍','折','涉','赊','赦','慑','奢','歙','厍','畲','猞','麝','滠','佘','拾','揲','睫','碟','聂','蛞'};
	public static final char[] SHEI = {
	'谁'};
	public static final char[] SHEN = {
		'身','伸','深','婶','神','甚','渗','肾','审','申','沈','绅','呻','参','砷','什','娠','慎','葚','糁','莘','诜','谂','矧','椹','渖','蜃','哂','胂','信','吲','抻','震'};
	public static final char[] SHENG = {
		'声','省','剩','生','升','绳','胜','盛','圣','甥','牲','乘','晟','渑','眚','笙','嵊','丞','冼','垩','姓','媵','甸'};
	public static final char[] SHI = {
		'是','使','十','时','事','室','市','石','师','试','史','式','识','虱','矢','拾','屎','驶','始','似','嘘','示','士','世','柿','匙','拭','誓','逝','势','什','殖','峙','嗜','噬','失','适','仕','侍','释','饰','氏','狮','食','恃','蚀','视','实','施','湿','诗','尸','豕','莳','埘','铈','舐','鲥','鲺','贳','轼','蓍','筮','炻','谥','弑','酾','螫','唑','堤','寺','彖','提','斯','汁','液','礻','筛','绎','耆','肢','舍','赫','郝','铊','铩','饣','饬'};
	public static final char[] SHOU = {
		'手','受','收','首','守','瘦','授','兽','售','熟','寿','艏','狩','绶','扌','涛'};
}
